---
kind: property
id: P:Autodesk.Revit.DB.Visual.Asset.AssetType
source: html/a1dd18ea-4c8a-afc9-0633-94cc65953fb1.htm
---
# Autodesk.Revit.DB.Visual.Asset.AssetType Property

The type of RenderingAsset

## Syntax (C#)
```csharp
public AssetType AssetType { get; }
```